БухЭксп/Documents/CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_РасходыПоГрузоперевозкамТранспортныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутевойЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатьиЗатратНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатьиЗатратНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ПробегТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ПробегТС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегПорожний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПробегСГрузом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходГСМТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходГСМТС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантОтраженияЗатратПоБУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыОтраженияЗатратПоБУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РаботаВодителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РаботаВодителей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЕздок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыРасходаТоплива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасходПоНорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходВПределахНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходСверхНормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходФактический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура РаспределитьЗатратыПоГрузоперевозкам(ПараметрыПроцедуры, АдресРезультата)  Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.ПутевойЛист КАК ПутевойЛист,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Грузоперевозка КАК Грузоперевозка,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.ДокументРасходов КАК ДокументРасходов,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Номенклатура КАК Номенклатура,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.СтатьяЗатрат КАК СтатьяЗатрат,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Валюта КАК Валюта,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Всего КАК Всего,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Сумма КАК Сумма,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.НДС КАК НДС,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат.Всего_Валюта КАК Всего_Валюта
		|ИЗ
		|	Документ.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.РаспределениеЗатрат КАК CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРаспределениеЗатрат";
		
		РезультатЗапроса 	= Запрос.Выполнить();
		ДанныеДляПроведения = РезультатЗапроса.Выгрузить();	
		
		ВалютаРегламентированногоУчета 	= Константы.ВалютаРегламентированногоУчета.Получить();
		
		ТипСтатьиЗатрат 				= Новый ОписаниеТипов("СправочникСсылка.СтатьиЗатрат"); 
		ТипНоменклатура 				= Новый ОписаниеТипов("СправочникСсылка.Номенклатура"); 
		
		ИмяСубконтоСтатьяЗатрат 		= "";
		ИмяПоляНоменклатура				= "";
		СтрокаГруппировки 				= "";
		ИменаПолей 						= Новый Соответствие;
		
		#Область Подгтовка_статей_затрат
		
		мСтатьиЗатрат_СтраховыеВзносы = Новый Массив;  
		мСтатьиЗатрат_ОплатаТруда 	  = Новый Массив;
		
		мВидыРасходовФОТ = Новый массив;
		мВидыРасходовФОТ.Добавить(Перечисления.ВидыРасходовНУ.ОплатаТруда);
		мВидыРасходовФОТ.Добавить(Перечисления.ВидыРасходовНУ.СтраховыеВзносы);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиЗатрат.Ссылка КАК Ссылка,
		|	СтатьиЗатрат.ВидРасходовНУ КАК ВидРасходовНУ
		|ИЗ
		|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
		|ГДЕ
		|	СтатьиЗатрат.ВидРасходовНУ В(&мВидыРасходовФОТ)";
		
		Запрос.УстановитьПараметр("мВидыРасходовФОТ", мВидыРасходовФОТ);
		
		РезультатЗапросаСтатьиЗатратФОТ = Запрос.Выполнить();
		
		Выборка_ФОТ = РезультатЗапросаСтатьиЗатратФОТ.Выбрать();
		
		Пока Выборка_ФОТ.Следующий() Цикл
			Если Выборка_ФОТ.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.ОплатаТруда тогда
				мСтатьиЗатрат_ОплатаТруда.Добавить(Выборка_ФОТ.Ссылка);
			ИначеЕсли Выборка_ФОТ.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.СтраховыеВзносы тогда
				мСтатьиЗатрат_СтраховыеВзносы.Добавить(Выборка_ФОТ.Ссылка);
			КонецЕсли;
		КонецЦикла;
		
		#КонецОбласти
		
		//В зависмости от настроке счеета учета получаем 
		//имена интересующих нас полей: Статья затрат и номенклатура	
		#Область Имена_полей_запроса_по_данным_счета_учета
		ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		
		Для Индекс = 1 По ДанныеСчета.КоличествоСубконто Цикл
			
			ТипЗначенияСубконто = ДанныеСчета["ВидСубконто" + Индекс + "ТипЗначения"];
			
			Если ТипЗначенияСубконто = ТипСтатьиЗатрат Тогда
				ИмяСубконтоСтатьяЗатрат = "Субконто"	+ Индекс;	
				ИмяПоляНоменклатура 	= "Номенклатура"+ Индекс;
			КонецЕсли;
			
		КонецЦикла;
		
		#КонецОбласти
		
		#Область Подготовка_данных
		
		Запрос = новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		//Подготови данные табличной части документа
		#Область Распределяемые_данные
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.НомерСтроки КАК НомерСтроки,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Ссылка.Организация КАК Организация,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.ПутевойЛист КАК ПутевойЛист,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.ДокументРасходов КАК ДокументРасходов,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Субконто1 КАК Субконто1,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Субконто2 КАК Субконто2,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Субконто3 КАК Субконто3,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы."+ИмяПоляНоменклатура+" КАК Номенклатура,
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Расходы КАК CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы
		|ГДЕ
		|	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкамРасходы.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПутевойЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка КАК ПутевойЛист,
		|	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка КАК Грузоперевозка
		|ПОМЕСТИТЬ ВТ_ГрузоперевозкиПутевыхЛистов
		|ИЗ
		|	Документ.CW_ПутевойЛист.ЭтапыМаршрута КАК CW_ПутевойЛистЭтапыМаршрута
		|ГДЕ
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеДокумента.ПутевойЛист КАК ПутевойЛист
		|			ИЗ
		|				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ПутевойЛистЭтапыМаршрута.Ссылка,
		|	CW_ПутевойЛистЭтапыМаршрута.Грузоперевозка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПутевойЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеДокумента.Организация КАК Организация,
		|	ВТ_ДанныеДокумента.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВТ_ДанныеДокумента.ПутевойЛист КАК ПутевойЛист,
		|	ВТ_ГрузоперевозкиПутевыхЛистов.Грузоперевозка КАК Грузоперевозка,
		|	ВТ_ДанныеДокумента.ДокументРасходов КАК ДокументРасходов,
		|	ВТ_ДанныеДокумента.Субконто1 КАК Субконто1,
		|	ВТ_ДанныеДокумента.Субконто2 КАК Субконто2,
		|	ВТ_ДанныеДокумента.Субконто3 КАК Субконто3,
		|	ВТ_ДанныеДокумента.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеДокумента.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ДанныеКРаспределению
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрузоперевозкиПутевыхЛистов КАК ВТ_ГрузоперевозкиПутевыхЛистов
		|		ПО ВТ_ДанныеДокумента.ПутевойЛист = ВТ_ГрузоперевозкиПутевыхЛистов.ПутевойЛист";
		
		Запрос.УстановитьПараметр("Ссылка" , ПараметрыПроцедуры.Ссылка);
		
		Запрос.Выполнить();
		
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_ДанныеДокумента";
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_ГрузоперевозкиПутевыхЛистов";
		Запрос.Выполнить();
		
		
		#КонецОбласти
		
		//Запишем соответствия в регистр
		#Область Запись_соответствий_номенклатуры_регистр
		
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат КАК СтатьяЗатрат,
		|	CW_СтатьиЗатратНоменклатуры.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ДействующиеСоответствия
		|ИЗ
		|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
		|ГДЕ
		|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеКРаспределению."+ИмяСубконтоСтатьяЗатрат+" КАК "+ИмяСубконтоСтатьяЗатрат+"
		|			ИЗ
		|				ВТ_ДанныеКРаспределению КАК ВТ_ДанныеКРаспределению)";
		
		Запрос.Выполнить();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВТ_ДанныеКРаспределению."+ИмяСубконтоСтатьяЗатрат+" КАК СтатьяЗатрат,
		|	ВТ_ДанныеКРаспределению.Номенклатура КАК НоменклатураДокумента,
		|	ЕСТЬNULL(ВТ_ДействующиеСоответствия.Номенклатура, НЕОПРЕДЕЛЕНО) КАК НоменклатураРегистра
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_ДанныеКРаспределению КАК ВТ_ДанныеКРаспределению
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДействующиеСоответствия КАК ВТ_ДействующиеСоответствия
		|		ПО ВТ_ДанныеКРаспределению."+ИмяСубконтоСтатьяЗатрат+" = ВТ_ДействующиеСоответствия.СтатьяЗатрат";
		
		Запрос.Выполнить();
		
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_ДействующиеСоответствия";
		Запрос.Выполнить();
		
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_Данные";
		Запрос.Выполнить();
		
		#КонецОбласти
		
		//Получаем базу распределения, в соответствии с настройками документа 
		#Область Основная_база_распределения
		
		Если ПараметрыПроцедуры.БазаРаспределения = 0 Тогда
			//Пропорционально пробегу пробегу
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_ПробегТСОбороты.ПутевойЛист КАК ПутевойЛист,
			|	CW_ПробегТСОбороты.Грузоперевозка КАК Грузоперевозка,
			|	CW_ПробегТСОбороты.ПробегОборот КАК Оборот
			|ПОМЕСТИТЬ ВТ_База
			|ИЗ
			|	РегистрНакопления.CW_ПробегТС.Обороты(
			|			,
			|			,
			|			Период,
			|			ПутевойЛист В
			|				(ВЫБРАТЬ
			|					ДанныеКРаспределению.ПутевойЛист
			|				ИЗ
			|					ВТ_ДанныеКРаспределению КАК ДанныеКРаспределению)) КАК CW_ПробегТСОбороты";
			
		Иначе
			//Пропорционально расходу гсм в пределах нормы
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	CW_РасходГСМТСОбороты.ПутевойЛист КАК ПутевойЛист,
			|	CW_РасходГСМТСОбороты.Грузоперевозка КАК Грузоперевозка,
			|	CW_РасходГСМТСОбороты.КоличествоОборот КАК Оборот
			|ПОМЕСТИТЬ ВТ_База
			|ИЗ
			|	РегистрНакопления.CW_РасходГСМТС.Обороты(
			|			,
			|			,
			|			Период,
			|			ПутевойЛист В
			|					(ВЫБРАТЬ
			|						ДанныеКРаспределению.ПутевойЛист
			|					ИЗ
			|						ВТ_ДанныеКРаспределению КАК ДанныеКРаспределению)
			|				И ВидРасходаТоплива = Значение(Перечисление.CW_ВидыРасходаТоплива.РасходВПределахНормы)) КАК CW_РасходГСМТСОбороты";
			
		КонецЕсли;
		
		Запрос.Выполнить();
		
		#КонецОбласти
		
		//Получаем базу распределения ФОТ при ее наличии
		#Область База_распределения_ФОТ
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_РаботаВодителейОбороты.ПутевойЛист КАК ПутевойЛист,
		|	CW_РаботаВодителейОбороты.Грузоперевозка КАК Грузоперевозка,
		|	СУММА(CW_РаботаВодителейОбороты.ЗарплатаОборот) КАК Оборот
		|ПОМЕСТИТЬ ВТ_БазаФОТ
		|ИЗ
		|	РегистрНакопления.CW_РаботаВодителей.Обороты(
		|			,
		|			,
		|			Период,
		|			ПутевойЛист В
		|				(ВЫБРАТЬ
		|					ДанныеКРаспределению.ПутевойЛист
		|				ИЗ
		|					ВТ_ДанныеКРаспределению КАК ДанныеКРаспределению)) КАК CW_РаботаВодителейОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_РаботаВодителейОбороты.Грузоперевозка,
		|	CW_РаботаВодителейОбороты.ПутевойЛист";
		
		Запрос.Выполнить();
		
		#КонецОбласти
		
		//Получаем коэффициенты распределения
		#Область Коэффициенты_распределения
		
		//Коэффициенты по настройкам документа
		#Область Коэффициенты_по_основной_базе_распределения
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_База.ПутевойЛист КАК ПутевойЛист,
		|	СУММА(ВТ_База.Оборот) КАК Оборот
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	ВТ_База КАК ВТ_База
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_База.ПутевойЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_База.ПутевойЛист КАК ПутевойЛист,
		|	ВТ_База.Грузоперевозка КАК Грузоперевозка,
		|	ВЫБОР
		|		КОГДА ВТ_Итоги.Оборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ (ВЫРАЗИТЬ(ВТ_База.Оборот КАК ЧИСЛО(38, 30))) / ВТ_Итоги.Оборот
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_Коэффициенты
		|ИЗ
		|	ВТ_База КАК ВТ_База
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоги КАК ВТ_Итоги
		|		ПО ВТ_База.ПутевойЛист = ВТ_Итоги.ПутевойЛист";
		
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_Итоги";
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_База";
		Запрос.Выполнить();
		
		#КонецОбласти
		
		//Коэффициенты по ФОТ
		#Область Коэффициенты_по_базе_ФОТ
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_БазаФОТ.ПутевойЛист КАК ПутевойЛист,
		|	СУММА(ВТ_БазаФОТ.Оборот) КАК Оборот
		|ПОМЕСТИТЬ ВТ_Итоги
		|ИЗ
		|	ВТ_БазаФОТ КАК ВТ_БазаФОТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_БазаФОТ.ПутевойЛист
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_БазаФОТ.ПутевойЛист КАК ПутевойЛист,
		|	ВТ_БазаФОТ.Грузоперевозка КАК Грузоперевозка,
		|	ВЫБОР
		|		КОГДА ВТ_Итоги.Оборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_БазаФОТ.Оборот КАК ЧИСЛО(38,30)) / ВТ_Итоги.Оборот
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_КоэффициентыФОТ
		|ИЗ
		|	ВТ_БазаФОТ КАК ВТ_БазаФОТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Итоги КАК ВТ_Итоги
		|		ПО ВТ_БазаФОТ.ПутевойЛист = ВТ_Итоги.ПутевойЛист";
		
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_Итоги";
		Запрос.Выполнить();
		
		#КонецОбласти
		
		#КонецОбласти
		
		//Дополняем таблицу полученными коэффициентами	
		#Область Распределяемые_данные_с_коэфициентами
		//Заполняем коэффициенты в данные к распределению
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТ_ДанныеКРаспределению.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеКРаспределению.Организация КАК Организация,
		|	ВТ_ДанныеКРаспределению.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВТ_ДанныеКРаспределению.ПутевойЛист КАК ПутевойЛист,
		|	ВТ_ДанныеКРаспределению.Грузоперевозка КАК Грузоперевозка,
		|	ВТ_ДанныеКРаспределению.ДокументРасходов КАК ДокументРасходов,
		|	ВТ_ДанныеКРаспределению.Субконто1 КАК Субконто1,
		|	ВТ_ДанныеКРаспределению.Субконто2 КАК Субконто2,
		|	ВТ_ДанныеКРаспределению.Субконто3 КАК Субконто3,
		|	ВТ_ДанныеКРаспределению.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеКРаспределению.Сумма КАК Сумма,
		|	IsNull(ВТ_Коэффициенты.Коэффициент,0) КАК Коэффициент,
		|	IsNull(ВТ_БазаФОТ.Оборот,0) КАК ФОТ,
		|	IsNull(ВТ_КоэффициентыФОТ.Коэффициент,0) КАК КоэффициентПоФОТ
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	ВТ_ДанныеКРаспределению КАК ВТ_ДанныеКРаспределению
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БазаФОТ КАК ВТ_БазаФОТ
		|		ПО ВТ_ДанныеКРаспределению.ПутевойЛист = ВТ_БазаФОТ.ПутевойЛист
		|			И ВТ_ДанныеКРаспределению.Грузоперевозка = ВТ_БазаФОТ.Грузоперевозка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Коэффициенты КАК ВТ_Коэффициенты
		|		ПО ВТ_ДанныеКРаспределению.ПутевойЛист = ВТ_Коэффициенты.ПутевойЛист
		|			И ВТ_ДанныеКРаспределению.Грузоперевозка = ВТ_Коэффициенты.Грузоперевозка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоэффициентыФОТ КАК ВТ_КоэффициентыФОТ
		|		ПО ВТ_ДанныеКРаспределению.ПутевойЛист = ВТ_КоэффициентыФОТ.ПутевойЛист
		|			И ВТ_ДанныеКРаспределению.Грузоперевозка = ВТ_КоэффициентыФОТ.Грузоперевозка";
		
		Запрос.Выполнить();
		
		//Убираем ненужные временные таблицы
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_ДанныеКРаспределению";
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_БазаФОТ";
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_Коэффициенты";
		Запрос.Выполнить();
		Запрос.Текст= "УНИЧТОЖИТЬ ВТ_КоэффициентыФОТ";
		Запрос.Выполнить();
		
		#КонецОбласти
		
		//Получам выборку итогоовой таблицы с иерархией по номерм строк распределение вполняем по каждой строке отдельно!
		#Область Итоговая_выборка_с_иерархией_по_номерам_строк_распределения
		
		Запрос.текст = 
		"ВЫБРАТЬ
		|	ВТ_Данные.НомерСтроки КАК НомерСтроки,
		|	ВТ_Данные.Организация КАК Организация,
		|	ВТ_Данные.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ВТ_Данные.ПутевойЛист КАК ПутевойЛист,
		|	ВТ_Данные.Грузоперевозка КАК Грузоперевозка,
		|	ВТ_Данные.Грузоперевозка.Заказ КАК Заказ,
		|	ВТ_Данные.ДокументРасходов КАК ДокументРасходов,
		|	ВТ_Данные.Субконто1 КАК Субконто1,
		|	ВТ_Данные.Субконто2 КАК Субконто2,
		|	ВТ_Данные.Субконто3 КАК Субконто3,
		|	ВТ_Данные.Номенклатура КАК Номенклатура,
		|	ВТ_Данные.Сумма КАК Сумма,
		|	ВТ_Данные.Коэффициент КАК Коэффициент,
		|	ВТ_Данные.ФОТ КАК ФОТ,
		|	ВТ_Данные.КоэффициентПоФОТ КАК КоэффициентПоФОТ
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|ИТОГИ
		|	МАКСИМУМ(Сумма),
		|	СУММА(Коэффициент),
		|	СУММА(ФОТ),
		|	СУММА(КоэффициентПоФОТ)
		|ПО
		|	НомерСтроки";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		#КонецОбласти
		
		#КонецОбласти
		
		#Область Распределение_данных
		
		Выборка_НомераСтрок = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_НомераСтрок.Следующий() Цикл
			
			Выборка_Детали = Выборка_НомераСтрок.Выбрать();
			
			СуммаРаспределенияПоСтроке = Выборка_НомераСтрок.Сумма;
			
			НомерСтроки = 0;
			Пока Выборка_Детали.Следующий()  Цикл
				
				НомерСтроки = НомерСтроки + 1;
				
				СтатьяЗатрат = Выборка_Детали[ИмяСубконтоСтатьяЗатрат];
				
				Если мСтатьиЗатрат_ОплатаТруда.Найти(СтатьяЗатрат) <> Неопределено Тогда
					//Это оплата труда
					Коэффициент 	=  Выборка_Детали.КоэффициентПоФОТ;
					РеквизитСуммы 	= "Сумма";
				ИначеЕсли мСтатьиЗатрат_СтраховыеВзносы.Найти(СтатьяЗатрат) <> Неопределено Тогда
					//Это страховые взносы
					Коэффициент 	= Выборка_Детали.КоэффициентПоФОТ;
					РеквизитСуммы 	= "Сумма";
				Иначе
					//Все остальные
					Коэффициент 	= Выборка_Детали.Коэффициент;
					РеквизитСуммы 	= "Сумма";
				КонецЕсли;
				
				СуммаДвижения	= Окр(Выборка_Детали[РеквизитСуммы] * Коэффициент, 2);
				
				Если Выборка_Детали.Количество() = НомерСтроки Тогда
					//Это последняя строка
					СуммаДвижения				= СуммаРаспределенияПоСтроке;
					СуммаРаспределенияПоСтроке  = 0;
				КонецЕсли;
				
				Если СуммаДвижения <> 0 Тогда
					
					НоваяСтрока 	= ДанныеДляПроведения.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_Детали);
					
					НоваяСтрока.СтатьяЗатрат 	= СтатьяЗатрат;
					НоваяСтрока.Валюта 			= ВалютаРегламентированногоУчета;	
					
					НоваяСтрока.Сумма 			= СуммаДвижения;
					НоваяСтрока.НДС 			= 0;
					НоваяСтрока.Всего 			= СуммаДвижения;
					НоваяСтрока.Всего_Валюта 	= СуммаДвижения;
					
					СуммаРаспределенияПоСтроке = СуммаРаспределенияПоСтроке - СуммаДвижения;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		#КонецОбласти
		
		ПоместитьВоВременноеХранилище(ДанныеДляПроведения, АдресРезультата);
		
КонецПроцедуры


Процедура ЗаполнитьТаблицыРаспределенияЗатрат() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам КАК CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам
	               |ГДЕ
	               |	CW_РаспределениеЗатратПутевыхЛистовПоГрузоперевозкам.Проведен =ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыНакопления.CW_РасходыПоГрузоперевозкамТранспортныхСредств.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Выборка.Ссылка);
		Набор.Прочитать();
		
		ТаблицаНабора = Набор.Выгрузить();
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.РаспределениеЗатрат.Загрузить(ТаблицаНабора);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
